/**
 * the response of sticker messages
 */
export class StickerResponse {
  public static replyText(stickerId: string): string {
    switch (stickerId) {
      case '60706990': // no.1
        return '星雨雞出生了!醫學界目前對自閉症的成因較傾向於先天性，與後天心理因素、社交環境因素無關。';
      case '60706991': // no.2
        return 'Hi~我是星雨雞';
      case '60706992': // no.3
        return '很多星兒都有固著行為的特質，簡單來說是對於某些事情有自己的堅持，例如圖片中的史塔非要抱著星雨雞睡覺不可。';
      case '60706993': // no.4
        return '<3';
      case '60706994': // no.5
        return '啊！只是問了一個問題，史塔怎麼滿頭問號不知所措呢？事實上，有些星兒比較難了解太複雜的句子。我們在溝通時，可以嘗試將要講的事情簡化，或分拆成不同的句子慢慢講述，確保星兒能完整接收你的意思喔！';
      case '60706995': // no.6
        return '明明什麼事都沒有，為什麼史塔突然很緊張地摀住耳朵呢？有些星兒的特定感官比較敏銳，以聽覺敏感的族群為例，對我們而言沒什麼大不了的日常聲音，在聽覺敏感的星兒聽來，可能是令人十分害怕的巨響！';
      case '60706996': // no.7
        return '星兒在一些行為上常常較有自己的堅持，他人很難要求他們做出改變。事實上，就像我們都會有一些小堅持或原則，不妨將星兒對某些偏好的堅持，看作類似狀況，情況允許，便以更寬容的心態來面對！';
      case '60706997': // no.8
        return '星雨雞駕到!';
      case '60706998': // no.9
        return '星兒們通常具有一定程度的社交溝通障礙，因此可能較缺少判斷他人表情、情緒的敏銳度。嘲諷、笑裡藏刀等微妙的表達，星兒常常難以領會，從而也容易在社交上吃虧。';
      case '60706999': // no.10
        return 'okok';
      case '60707000': // no.11
        return '星兒在溝通時，可能要花比較長的時間，來做出完整的表達。請以足夠的耐心等待、聽取。';
      case '60707001': // no.12
        return '星兒們因為是用不同的方式在看待世界、表達自己的想法，所以會用比較特別的方式與他人溝通，有時難免讓人覺得不明所以，甚至違反社會上的常見價值觀，我們要試著站在他們的角度猜測語意。';
      case '60707002': // no.13
        return '史塔喜歡看書，書卻總是反著拿，他可能並不了解一般我們讀書的目的，只是喜歡學大家把書拿起來而已，也有可能他就是這樣讀書。星兒們看世界的角度與對世界的理解，可能和我們不同，要從與每個星兒的個別互動中，耐心理解他們各種行為背後的想法和原因。';
      case '60707003': // no.14
        return '史塔在拖地，也許是因為他非常愛乾淨；也許是因為他喜歡「拖地」這個動作；也許是只喜歡拖已經很乾淨的地；也有可能是因為「拖地」能獲得讚美，所以才喜歡拖地。什麼原因都有可能，更多的理解才能更認識星兒';
      case '60707004': // no.15
        return '好熱喔...';
      case '60707005': // no.16
        return '很多人說自閉症的朋友們因為有著自己對這個世界特別的理解跟表達方式，就像是外星來的朋友一樣，因此稱他們為星兒。';
      case '60707006': // no.17
        return '一直下雨真煩...';
      case '60707007': // no.18
        return '星兒們的喜好、喜歡的景象五花八門，例如洗衣機的水流、車窗外連成一線的街景等。每個人都有自己的喜好，星兒跟我們並沒有什麼不同';
      case '60707008': // no.19
        return '星兒和任何人都一樣，會因為不被接納、遇到困難感到負面。雖然需要陪伴和支持，星兒的表達方式可能較難為人所理解，反而換來他人歧視、疏遠的眼光。當遇到星兒情緒躁動、低落時，我們應像個可靠的夥伴，冷靜找出他負面的原因和解決辦法';
      case '60707009': // no.20
        return '星兒在交友上的諸多先天困難，往往讓他被排除在正常社交活動外。事實上，星兒也需要，甚至渴望與朋友、團體的互動。';
      case '60707010': // no.21
        return '星兒很多時候無法理解一般人表達情緒的方式，例如「XD」對他們來說或許僅是兩個英文字母，星兒可能無法感受對方的喜悅。';
      case '60707011': // no.22
        return '棒棒棒';
      case '60707012': // no.23
        return '星兒們常會無法理解一個語句完整的意思，有時會只擷取語句的部分，因而做出和一般預期不一樣的行為。例如對星兒說「不要跑」，星兒可能只接收了「跑」這個字，叫星兒「別打斷我的話」，只接收到「打斷我的話」等等。';
      case '60707013': // no.24
        return '星兒們常有自己對一件事情特別的想法，甚至常常是一般人所想像不到的好主意。';
      case '60707014': // no.25
        return '有些星兒不太能掌握「你我他」等較為抽象的代名詞，和星兒對話，盡量避免使用，避免星兒在用語轉換上遇到困難。例如，稱星兒為「你」，星兒極有可能認為「你」便完全等同於自己，在表達自己肚子餓時，便可能會說「你肚子餓了」，而非「我肚子餓了」。';
      case '60707015': // no.26
        return '天冷要泡湯';
      case '60707016': // no.27
        return '開心出去玩~';
      case '60707017': // no.28
        return '生日快樂!';
      case '60707018': // no.29
        return '好冷...';
      case '60707019': // no.30
        return '星兒們很多時候的舉動是善意的，只是一般人或許無法理解，就像史塔想分雞腿給星雨雞吃，但只會讓星雨雞覺得很恐怖！只要我們用心去理解，一定可以懂的。';
      case '60707020': // no.31
        return '抱抱';
      case '60707021': // no.32
        return '星兒一出生的時候眼前就像有一面玻璃阻擋著他與外面的世界，沒辦法很直接的去感受這個世界，為了理解這個世界要花非常多的時間和精力；而更嚴重的星兒，可能眼前不只是一面普通玻璃，而是霧面的玻璃，更難以看清世界。';
      case '60707022': // no.33
        return '好累...';
      case '60707023': // no.34
        return '有些星兒比較容易對陌生環境感到緊張，表現方式也容易過於激烈。';
      case '60707024': // no.35
        return '有些事情你覺得不太可能發生，像是亂丟一些電器用品，因為它容易壞，所以就不會太粗魯，但一些星兒感覺統合較弱，無法適當拿捏力道，所以會有一些「很用力摔門」、「很大力放東西」的情形。';
      case '60707025': // no.36
        return '餓了就要吃';
      case '60707026': // no.37
        return '史塔看著天空，不知道又想到什麼了。星兒認識世界的方式、價值判斷和做選擇的思路，可能和社會常規不太一致。在合理範圍內，不妨以同理、欣賞的態度觀之，即使認為有需要調整，也請盡量以委婉溫和的勸說或約定，代替嚴厲的矯正';
      case '60707027': // no.38
        return '生病了...';
      case '60707028': // no.39
        return '史塔面反著寫下SORRY一詞，而且是從Y倒著寫過來的。到底為什麼會這樣寫字呢？真是難以理解。星兒心中的世界，你可能無法輕易參透，但是你可以透過觀察得到一些結論，他可能不擅表達要透過寫字，他可能很喜歡寫反字，他也可能覺得很抱歉卻難以表達...等等。';
      case '60707029': // no.40
        return 'shhhh...安靜';
      default:
        return '';
    }
  }
}
